bazanski/espDash/firmware/esp32-gateway/src/main.cpp
static inline void ring_push(const RawSlot *s) {
    portENTER_CRITICAL(&ring_mux);
    uint16_t next = (uint16_t)((ring_head + 1) % RAW_RING_SIZE);
    if (next == ring_tail) {
        // Full: drop the OLDEST frame so live monitoring stays current, and
        // count it. A lossy capture must be visible, never silent.
        ring_tail = (uint16_t)((ring_tail + 1) % RAW_RING_SIZE);
        raw_dropped++;
    }
    raw_ring[ring_head] = *s;
    ring_head = next;
    portEXIT_CRITICAL(&ring_mux);
}

static inline bool ring_pop(RawSlot *out) {
    bool got = false;
    portENTER_CRITICAL(&ring_mux);
    if (ring_tail != ring_head) {
        *out = raw_ring[ring_tail];
        ring_tail = (uint16_t)((ring_tail + 1) % RAW_RING_SIZE);
        got = true;
    }
    portEXIT_CRITICAL(&ring_mux);
    return got;
}

// =========================================================================
// NETWORK
// =========================================================================
#if ESPDASH_GATEWAY_WIFI
static WiFiMulti wifiMulti;
static WebSocketsServer webSocket = WebSocketsServer(8888);
static WiFiServer telnetServer(8889);
static WiFiClient telnetClient;
static String last_connected_ip = "";

// Once true, Wi-Fi has been deliberately abandoned for the rest of this boot
// so ESP-NOW can sit on a fixed, stable channel. See the fallback logic in
// loop() for why this exists. Only meaningful when a connection was ever
// attempted in the first place.
static volatile bool wifi_fallback_engaged = false;
#endif

static uint8_t broadcast_mac[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
static uint16_t espnow_seq = 0;
// Separate sequence space for canlog packets. Sharing espnow_seq with the
// 20 Hz telemetry stream made the node count every telemetry packet as a
// missing canlog packet: a verified-lossless 16 s capture reported 343 gaps,
// almost exactly the 320 telemetry + 8 ID-table packets sent in that window.
// A loss counter that cries wolf is worse than none - it would have masked
// real loss on the very first drive that had any.
static uint16_t canlog_seq = 0;
static volatile uint32_t espnow_send_fail = 0;
static volatile uint32_t tx_truncated = 0;

// canlog counters, reported by STATS so a lossy capture is visible
static volatile uint32_t canlog_batches_sent = 0;
static volatile uint32_t canlog_frames_sent = 0;
static volatile uint32_t canlog_send_fail = 0;
static volatile uint32_t espnow_rx_any = 0;   // any ESP-NOW packet received
static volatile uint32_t espnow_rx_cmd = 0;   // parsed as a node command

// USB CDC and TCP both accept short writes: write() returns how many bytes it
// actually took, which is less than requested once the peer stops draining.
// Ignoring that return value corrupts the stream - observed as JSON lines
// missing whole 64-byte USB packets from the middle, because the tail of one
// line and the head of the next were both discarded. Loop until the whole
// buffer is gone.
//
// Blocking here is safe by design: canRxTask is independent, so a slow reader
// backs up into the ring buffer, which drops oldest and counts it. The guard
// bounds the wait so a peer that has stopped reading entirely cannot wedge
// publishTask - we give up and count a truncation instead.
static void write_all(Print &out, const uint8_t *buf, size_t len) {
    size_t sent = 0;
    int stalls = 0;
    while (sent < len && stalls < 50) {
        size_t n = out.write(buf + sent, len - sent);
        if (n == 0) { stalls++; vTaskDelay(1); }
        else { sent += n; stalls = 0; }
    }
    if (sent < len) tx_truncated++;
}

// Every enabled transport gets a byte-identical payload. MUST only be called
// from publishTask (WebSockets library is not thread-safe).
static void broadcast_line(const char *str) {
    size_t len = strlen(str);
    write_all(Serial, (const uint8_t *)str, len);
#if ESPDASH_GATEWAY_WIFI
    if (telnetClient && telnetClient.connected()) {
        write_all(telnetClient, (const uint8_t *)str, len);
    }
    webSocket.broadcastTXT((uint8_t *)str, len);
#endif
}

// =========================================================================
// DEMO GENERATOR
// =========================================================================
// Applied to the published snapshot rather than to the CAN state, so it no
// longer depends on CAN frames arriving. Previously brake and throttle were
// promoted inside the RX loop, so on a quiet bench bus the demo's braking
// never reached the dashboard at all.
static void apply_demo(CanDecodeState *s, float sim_t) {
    float cycle = fmodf(sim_t, 12.0f) / 12.0f;
    float rpm_val = 800.0f, spd_val = 0.0f;
    uint8_t gear_idx = 3;

    if (cycle < 0.25f) {
        gear_idx = 1;
        rpm_val = 900.0f + (cycle / 0.25f) * 5600.0f;
        spd_val = (rpm_val / 6500.0f) * 35.0f;
    } else if (cycle < 0.55f) {
        gear_idx = 2;
        float p = (cycle - 0.25f) / 0.30f;
        rpm_val = 3000.0f + p * 4000.0f;
        spd_val = 35.0f + p * 35.0f;
    } else if (cycle < 0.85f) {
        gear_idx = 3;
        float p = (cycle - 0.55f) / 0.30f;
        rpm_val = 3500.0f + p * 3500.0f;
        spd_val = 70.0f + p * 45.0f;
    } else {
        gear_idx = 4;
        float p = (cycle - 0.85f) / 0.15f;
        rpm_val = 3500.0f - p * 1200.0f;
        spd_val = 115.0f - p * 25.0f;
    }

    uint8_t throt = (uint8_t)constrain((int)(max(0.0f, sinf(sim_t * 1.2f)) * 100.0f), 0, 100);
    int16_t steer = (int16_t)(160.0f * sinf(sim_t * 0.3f));

    s->rpm             = (uint16_t)rpm_val;
    s->speed_kmh_x10   = (uint16_t)(spd_val * 10.0f);
    s->water_temp_x10  = (int16_t)((87.0f + 3.0f * sinf(sim_t * 0.1f)) * 10.0f);
    s->oil_temp_x10    = (int16_t)((92.0f + 4.0f * sinf(sim_t * 0.08f)) * 10.0f);
    s->battery_mv      = (uint16_t)((13.8f + 0.3f * sinf(sim_t * 0.5f)) * 1000.0f);
    s->gear            = gear_idx;
    s->fuel_pct        = 78;
    s->throttle_pct    = throt;
    s->steering_deg    = steer;
    s->ambient_temp    = 23;

    float corner = (steer / 160.0f) * 3.5f;
    s->wheel_fl_x10 = (uint16_t)(max(0.0f, spd_val - corner) * 10.0f);
    s->wheel_fr_x10 = (uint16_t)(max(0.0f, spd_val + corner) * 10.0f);
    s->wheel_rl_x10 = (uint16_t)(max(0.0f, spd_val - corner * 0.7f) * 10.0f);
    s->wheel_rr_x10 = (uint16_t)(max(0.0f, spd_val + corner * 0.7f) * 10.0f);

    s->brake_switch = (throt < 10);
    s->brake_pct    = (throt < 10) ? 25 : 0;
}

// =========================================================================
// COMMANDS  (called from publishTask only)
// =========================================================================
static void process_cmd_string(String cmd) {
    cmd.trim();
    cmd.toUpperCase();
    if (cmd == "MODE:PLOT" || cmd == "MODE_PLOT" || cmd == "MODE:TELEMETRY") {
        current_mode = MODE_TELEMETRY;
        broadcast_line("[MODE] Switched to TELEMETRY_PLOT\n");
    } else if (cmd == "MODE:RAW" || cmd == "MODE_RAW" || cmd == "MODE:SNIFFER") {
        current_mode = MODE_RAW_SNIFFER;
        broadcast_line("[MODE] Switched to RAW_SNIFFER\n");
    } else if (cmd == "MODE:DUAL" || cmd == "MODE_DUAL" || cmd == "MODE:BOTH") {
        current_mode = MODE_DUAL;
        broadcast_line("[MODE] Switched to DUAL (RAW CAN + TELEMETRY JSON)\n");
    } else if (cmd == "DEMO:ON" || cmd == "DEMO_ON" || cmd == "DEMO:1") {
        demo_mode = true;
        broadcast_line("[DEMO] Demo Telemetry Generator ENABLED\n");
    } else if (cmd == "DEMO:OFF" || cmd == "DEMO_OFF" || cmd == "DEMO:0") {
        demo_mode = false;
        broadcast_line("[DEMO] Demo Telemetry Generator DISABLED (Real CAN active)\n");
    } else if (cmd == "DEMO:TOGGLE") {
        demo_mode = !demo_mode;
        char buf[64];
        snprintf(buf, sizeof(buf), "[DEMO] Demo Telemetry is now %s\n",
                 demo_mode ? "ENABLED" : "DISABLED");
        broadcast_line(buf);
    } else if (cmd == "MODE:GET") {
        char buf[100];
        const char *m = (current_mode == MODE_TELEMETRY) ? "TELEMETRY"
                      : (current_mode == MODE_RAW_SNIFFER) ? "RAW_SNIFFER" : "DUAL";
        snprintf(buf, sizeof(buf), "[MODE] CURRENT:%s | DEMO:%s\n", m, demo_mode ? "ON" : "OFF");
        broadcast_line(buf);
    } else if (cmd == "LOG:ON" || cmd == "LOG_ON" || cmd == "LOG:1") {
        canlog_manual = true;
        broadcast_line("[LOG] CAN log streaming ENABLED (ESP-NOW -> SD recorder)\n");
    } else if (cmd == "LOG:OFF" || cmd == "LOG_OFF" || cmd == "LOG:0") {
        canlog_manual = false;
        broadcast_line("[LOG] CAN log streaming DISABLED\n");
    } else if (cmd == "LOGTEST:ON" || cmd == "LOGTEST:1") {
        // Deliberately NOT reset: canlog_frames_sent and every other STATS
        // counter is cumulative since boot, so zeroing this one made
        // "injected" and "logframes" incomparable across two runs on one
        // power cycle and looked like frames were being duplicated. Keeping
        // it monotonic also means the sequence numbers in a capture stay
        // unique for the whole session.
        logtest_mode = true;
        broadcast_line("[LOGTEST] synthetic 1400 fps injector ENABLED (needs LOG:ON or a node)\n");
    } else if (cmd == "LOGTEST:OFF" || cmd == "LOGTEST:0") {
        logtest_mode = false;
        char b[64];
        snprintf(b, sizeof(b), "[LOGTEST] disabled after %lu frames\n", (unsigned long)logtest_seq);
        broadcast_line(b);
    } else if (cmd == "STATS") {
        char buf[256];
#if ESPDASH_GATEWAY_WIFI
        snprintf(buf, sizeof(buf),
                 "[STATS] decoded:%lu cksum_rejects:%lu ring_dropped:%lu twai_qfull:%lu "
                 "tx_trunc:%lu espnow_fail:%lu wifi_fallback:%s "
                 "log:%s batches:%lu logframes:%lu logfail:%lu rx_any:%lu rx_cmd:%lu "
                 "injected:%lu\n",
                 (unsigned long)g_snapshot.frames_decoded,
                 (unsigned long)g_snapshot.checksum_rejects,
                 (unsigned long)raw_dropped,
                 (unsigned long)twai_queue_full_events,
                 (unsigned long)tx_truncated,
                 (unsigned long)espnow_send_fail,
                 wifi_fallback_engaged ? "yes" : "no",
                 canlog_active() ? "on" : "off",
                 (unsigned long)canlog_batches_sent,
                 (unsigned long)canlog_frames_sent,
                 (unsigned long)canlog_send_fail,
                 (unsigned long)espnow_rx_any,
                 (unsigned long)espnow_rx_cmd,
                 (unsigned long)logtest_seq);
#else
        // No wifi_fallback field: with no Wi-Fi station ever attempted,
        // there's no connection to fall back from. espnow_send_fail is still
        // meaningful - esp_now_send() can fail for reasons unrelated to
        // Wi-Fi, such as an internal queue full.
        snprintf(buf, sizeof(buf),
                 "[STATS] decoded:%lu cksum_rejects:%lu ring_dropped:%lu twai_qfull:%lu "
                 "tx_trunc:%lu espnow_fail:%lu "
                 "log:%s batches:%lu logframes:%lu logfail:%lu rx_any:%lu rx_cmd:%lu "
                 "injected:%lu\n",
                 (unsigned long)g_snapshot.frames_decoded,
                 (unsigned long)g_snapshot.checksum_rejects,
                 (unsigned long)raw_dropped,
                 (unsigned long)twai_queue_full_events,
                 (unsigned long)tx_truncated,
                 (unsigned long)espnow_send_fail,
                 canlog_active() ? "on" : "off",
                 (unsigned long)canlog_batches_sent,
                 (unsigned long)canlog_frames_sent,
                 (unsigned long)canlog_send_fail,
                 (unsigned long)espnow_rx_any,
                 (unsigned long)espnow_rx_cmd,
                 (unsigned long)logtest_seq);
#endif
        broadcast_line(buf);
    }
}

